/*=============================================================================================
* 
*      *******    *******         **    **
*      **         **              **    **
*      **         **              **    **
*      *******    *******   **    ********
*           **    **              **    **
*           **    **              **    **
*      *******    **              **    **
*
* 创建者：韩顺发
* CLR版本：4.0.30319.42000
* 电子邮箱：shunfa.han@kstopa.com.cn
* 创建时间：2023/12/11 10:24:00
* 版本：v1.0.0
* 描述：
*
* ==============================================================================================
* 修改人：
* 修改时间：
* 修改说明：
* 版本：
* 
===============================================================================================*/

namespace EasyPlc.Application;

/// <summary>
/// 队列中事件记录
/// </summary>
[SugarTable("rabbitmq_realtimedata_log", TableDescription = "队列记录")]
[Tenant(SqlsugarConst.DB_Default)]
public class RabbitMqRealtimeDataLog : RabbitMqaLog
{

}
